data/tests/echo/rust_epoll_250_1.txt
Run 1:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /echo/hello
Document Length:        5 bytes

Concurrency Level:      250
Time taken for tests:   0.695 seconds
Complete requests:      300
Failed requests:        0
Total transferred:      20700 bytes
HTML transferred:       1500 bytes
Requests per second:    431.57 [#/sec] (mean)
Time per request:       579.282 [ms] (mean)
Time per request:       2.317 [ms] (mean, across all concurrent requests)
Transfer rate:          29.08 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       22   74  32.3     66     157
Processing:    42  156 106.3    114     567
Waiting:       29  152 100.5    114     567
Total:         70  231 109.7    207     633

Percentage of the requests served within a certain time (ms)
  50%    207
  66%    235
  75%    249
  80%    296
  90%    392
  95%    402
  98%    564
  99%    631
 100%    633 (longest request)